Revit 2027 API
CustomInitialColor Class
 This class encapsulates a custom initial lighting color.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Lighting.InitialColor
 Autodesk.Revit.DB.Lighting.CustomInitialColor
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CustomInitialColor : InitialColor
Public Class CustomInitialColor
	Inherits InitialColor
public ref class CustomInitialColor : public InitialColor
type CustomInitialColor =
    class
        inherit InitialColor
    end
The CustomInitialColor type exposes the following members.
Constructors
Name | Description
CustomInitialColor(CustomInitialColor) |  Creates a copy of the given custom initial color
CustomInitialColor(Double) |  Creates a custom initial color set to the given color
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from InitialColor)
Temperature |  The custom color temperature value.
TemperatureValue |  The light color temperature value in Kelvins.
(Inherited from InitialColor)
Top
Methods
Name | Description
Clone |  Creates a copy of the InitialColor derived object.
(Inherited from InitialColor)
Dispose
(Inherited from InitialColor)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 This color is called an initial color because a color filter can also be added to modify the color.
See Also
Reference
Autodesk.Revit.DB.Lighting Namespace